---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ColorFillLegend
source: html/b8e31474-3699-993e-bdf5-b1681ed0e10d.htm
---
# ColorFillLegend Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.